result/wrk11-1593405366.txt
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   506.01us  557.54us   9.30ms   92.21%
    Req/Sec    11.75k     1.48k   14.68k    57.07%
  Latency Distribution
     50%       0.37 ms
     75%       0.42 ms
     90%       0.57 ms
     99%       3.14 ms
  2807885 requests in 60100580, 29.22GB read
Requests/sec:  46719.77
Transfer/sec:    497.83MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.50ms    3.54ms  54.32ms   89.39%
    Req/Sec    14.95k     2.35k   22.25k    67.46%
  Latency Distribution
     50%       1.03 ms
     75%       2.92 ms
     90%       6.31 ms
     99%      17.84 ms
  3569810 requests in 60075935, 37.15GB read
  Socket errors: connect 0, read 26364, write 0, timeout 0
Requests/sec:  59421.63
Transfer/sec:    633.17MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.21ms    5.44ms 224.79ms   97.27%
    Req/Sec    13.58k   462.82    17.14k    73.17%
  Latency Distribution
     50%       6.56 ms
     75%       7.24 ms
     90%       9.06 ms
     99%      14.15 ms
  3243283 requests in 60030655, 33.75GB read
  Socket errors: connect 0, read 682531, write 0, timeout 0
Requests/sec:  54027.11
Transfer/sec:    575.68MB
Running 1m test @ http://192.168.1.4/index.html
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.24ms  265.50ms   7.11s    95.78%
    Req/Sec     9.76k     0.85k   13.48k    69.50%
  Latency Distribution
     50%      12.91 ms
     75%      50.10 ms
     90%     205.30 ms
     99%     907.24 ms
  2329982 requests in 60058477, 24.25GB read
  Socket errors: connect 0, read 478253, write 0, timeout 0
Requests/sec:  38795.22
Transfer/sec:    413.38MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   356.15us  360.96us   8.17ms   96.79%
    Req/Sec     5.96k   594.37     7.38k    64.12%
  Latency Distribution
     50%       0.28 ms
     75%       0.34 ms
     90%       0.41 ms
     99%       2.56 ms
  3096458 requests in 60086710, 32.22GB read
  Socket errors: connect 20, read 0, write 0, timeout 0
Requests/sec:  51533.16
Transfer/sec:    549.12MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.49ms    3.59ms  50.27ms   88.44%
    Req/Sec     6.84k     0.98k   12.60k    69.56%
  Latency Distribution
     50%       0.74 ms
     75%       2.99 ms
     90%       6.74 ms
     99%      17.42 ms
  4083904 requests in 60089172, 42.50GB read
  Socket errors: connect 0, read 30745, write 0, timeout 0
Requests/sec:  67964.06
Transfer/sec:    724.19MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.65ms    6.13ms 235.12ms   98.10%
    Req/Sec     5.21k   310.07    20.03k    86.36%
  Latency Distribution
     50%       7.01 ms
     75%       7.75 ms
     90%       9.38 ms
     99%      14.71 ms
  3114234 requests in 60100176, 32.41GB read
  Socket errors: connect 0, read 624806, write 0, timeout 0
Requests/sec:  51817.39
Transfer/sec:    552.14MB
Running 1m test @ http://192.168.1.4/index.html
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    59.72ms  116.86ms   3.63s    88.21%
    Req/Sec     3.89k   432.48     6.98k    73.46%
  Latency Distribution
     50%      13.18 ms
     75%      43.91 ms
     90%     189.88 ms
     99%     491.67 ms
  2323828 requests in 60033951, 24.18GB read
  Socket errors: connect 0, read 478953, write 0, timeout 0
Requests/sec:  38708.56
Transfer/sec:    412.46MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   358.90us   60.93us  10.46ms   75.43%
    Req/Sec     2.62k   102.63     3.44k    81.47%
  Latency Distribution
     50%       0.36 ms
     75%       0.39 ms
     90%       0.42 ms
     99%       0.49 ms
  2869814 requests in 60049549, 29.86GB read
  Socket errors: connect 20, read 0, write 0, timeout 0
Requests/sec:  47790.77
Transfer/sec:    509.24MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms    3.47ms  58.19ms   90.38%
    Req/Sec     3.11k   616.40     6.21k    73.12%
  Latency Distribution
     50%       1.26 ms
     75%       2.62 ms
     90%       5.72 ms
     99%      18.05 ms
  3720876 requests in 60087476, 38.72GB read
  Socket errors: connect 0, read 33033, write 0, timeout 0
Requests/sec:  61924.32
Transfer/sec:    659.84MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.71ms    6.69ms 422.41ms   98.69%
    Req/Sec     2.59k   172.00     9.76k    80.25%
  Latency Distribution
     50%       7.03 ms
     75%       7.81 ms
     90%       9.51 ms
     99%      14.78 ms
  3096969 requests in 60097829, 32.23GB read
  Socket errors: connect 0, read 628519, write 0, timeout 0
Requests/sec:  51532.13
Transfer/sec:    549.10MB
Running 1m test @ http://192.168.1.4/index.html
  20 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.88ms  123.26ms   7.06s    89.02%
    Req/Sec     1.94k   284.65    10.03k    75.17%
  Latency Distribution
     50%      13.29 ms
     75%      49.13 ms
     90%     191.84 ms
     99%     503.06 ms
  2321524 requests in 60080641, 24.16GB read
  Socket errors: connect 0, read 481904, write 0, timeout 0
Requests/sec:  38640.13
Transfer/sec:    411.73MB